[
  {
    "title": "Full-Stack Web Developer",
    "company": "Freelance",
    "duration": "Aug 2025 - Present",
    "location": "Toronto, Canada",
    "responsibilities": [
      "Developed fully responsive websites using the MERN stack",
      "Built custom admin panels for real-time content management",
      "Implemented server-side rendering with Next.js for SEO optimization",
      "Managed end-to-end project delivery and client communication"
    ],
    "achievements": [
      "Resolved critical usability issues on outdated client sites",
      "Increased engagement for over 150 customers",
      "Built user-friendly admin panel for real-time content updates to pricing and schedules",
      "Improved search engine rankings and organic traffic through SSR implementation",
      "Reduced data entry errors with intuitive admin interface"
    ],
    "technologies": [
      "React",
      "Next.js",
      "Node.js",
      "MongoDB",
      "Express.js",
      "TypeScript",
      "Tailwind CSS"
    ]
  },
  {
    "title": "UI/UX Designer",
    "company": "Lollypop Design Studio Vietnam",
    "duration": "Jul 2022 - Jun 2024",
    "location": "Vietnam",
    "responsibilities": [
      "Collaborated with product owners and cross-functional teams",
      "Conducted UX research including interviews and data analysis",
      "Designed high-fidelity UI prototypes from wireframes and sitemaps",
      "Optimized information architecture for desktop and mobile platforms"
    ],
    "achievements": [
      "Achieved 30% reduction in user navigation time through IA optimization",
      "Enhanced overall site usability across desktop and mobile platforms",
      "Conducted over 5 UX research sessions with insightful reports",
      "Designed and conducted A/B tests on 20+ high-fidelity UI prototypes",
      "Increased stakeholder approval rates by 40%",
      "Ensured alignment with business objectives through data-driven design"
    ],
    "skills_demonstrated": [
      "User research and analysis",
      "High-fidelity prototyping",
      "Information architecture",
      "A/B testing and iteration",
      "Stakeholder communication",
      "Cross-functional collaboration"
    ]
  },
  {
    "career_transition": {
      "reason": "Why I Transitioned from Design to Development",
      "details": "After spending two years as a UI/UX Designer at Lollypop Design Studio, I often saw the user experience get lost in translation when designs were handed off to developers. I realized that optimizing information architecture on a canvas was not enough - to truly control the end-to-end experience, I needed to build it myself. This realization drove me to pursue full-stack development while retaining my design thinking foundation."
    }
  }
]
